# frozen_string_literal: true

# Brewfile - Brewfile for setting up and managing packages

# Tap additional repositories
tap 'hashicorp/tap'

# GUI Apps from cask
cask 'affinity'
cask 'balenaetcher'
cask 'brave-browser'
cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'codex'
# cask 'container'
cask 'discord'
cask 'docker-desktop'
cask 'ghostty'
cask 'google-chrome'
cask 'google-drive'
cask 'logi-options+'
cask 'microsoft-teams'
cask 'obsidian'
cask 'postman'
cask 'qflipper'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'steam'
cask 'utm'
cask 'viscosity'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'yubico-authenticator'
cask 'zoom'

# Homebrew packages
brew 'awscli'
brew 'bazelisk'
brew 'btop'
brew 'ctlptl'
brew 'dive'
brew 'fd'
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'goenv'
brew 'grip'
brew 'hadolint'
brew 'hashicorp/tap/terraform-ls'
brew 'helm'
brew 'huggingface-cli'
brew 'jc'
brew 'jq'
brew 'kind'
brew 'kubernetes-cli'
brew 'luarocks'
brew 'neovim'
brew 'nodenv'
brew 'pcre'
brew 'pixi'
brew 'pyenv'
brew 'rbenv'
brew 'redis', restart_service: :changed
brew 'ripgrep'
brew 'shellcheck'
brew 'tfenv'
brew 'tflint'
brew 'tilt'
brew 'tmux'
brew 'tree-sitter'
brew 'universal-ctags'
brew 'watch'
brew 'yamllint'
brew 'ykman'
brew 'yq'
brew 'yubikey-personalization'
brew 'zsh-syntax-highlighting'

# Mac only packages and utilities
if OS.mac?
  brew 'bash'
  brew 'curl'
  brew 'docker-compose'
  brew 'gnu-sed'
  brew 'imagemagick'
  brew 'mas'
  brew 'pinentry-mac'
  brew 'tree'
  brew 'wget'
  mas 'Amphetamine', id: 937_984_704
end

# VSCode Extensions
vscode 'bazelbuild.vscode-bazel'
vscode 'bierner.github-markdown-preview'
vscode 'bierner.markdown-checkbox'
vscode 'bierner.markdown-footnotes'
vscode 'bierner.markdown-mermaid'
vscode 'bierner.markdown-preview-github-styles'
vscode 'emily-curry.base16-tomorrow-dark-vscode'
vscode 'file-icons.file-icons'
vscode 'golang.go'
vscode 'hashicorp.terraform'
vscode 'ms-python.python'
vscode 'openai.chatgpt'
vscode 'pomdtr.excalidraw-editor'
vscode 'tilt-dev.tiltfile'
vscode 'tim-koehler.helm-intellisense'
vscode 'timonwong.shellcheck'
vscode 'vscodevim.vim'
